[
  [
    {
      "id": "m0wo0x",
      "speakers": ["KarthikRanganathan"],        
      "talk": "Introduction to YugabyteDB - Design and Architecture",
      "time": "10 - 10.30 am",        
      "start": "2021-01-20T10:00:00+05:30",
      "end": "2021-01-20T10:30:00+05:30",
      "description": "This workshop will introduce the architecture along with the basic concepts of YugabyteDB, a distributed SQL database. Learn about how data is distributed and replicated across a cluster of nodes to ensure high availability even on failures, how to scale out the cluster by simply adding nodes - without compromising ACID semantics and data integrity."
    },   
    {
      "id": "u9wkps",
      "speakers": ["AlanCaldera"],
      "talk": "Migrating from Oracle to YugabyteDB",
      "time": "10.30 - 11 am",
      "start": "2021-01-20T10:30:00+05:30",
      "end": "2021-01-20T11:00:00+05:30",
      "description": "In this session, we will cover some tricks and tools to migrate Oracle to YugabyteDB. Topics covered will include schema migration, data type mapping, migration tools, and other scenarios."
    },
    {
      "id": "p4s49m",
      "speakers": ["AmeyBanarse","NikhilChandrappa"],
      "talk": "Yugabyte - Spring Developer Workshop",
      "time": "11 am - 12.30 pm",
      "start": "2021-01-20T11:00:00+05:30",
      "end": "2021-01-20T12:30:00+05:30",
      "description": "In this workshop, we'll look at how to build data-driven microservices apps using Spring Boot and the Yugabyte Distributed SQL database. This will be focused on building a Retail Catalog lookup application use case, which is a low-latency, resilient, and HA lookup web-service. This will be a hands-on session where developers will get started with implementation of the Product Catalog and Cart microservices using familiar Spring projects like Spring Web, Spring Data Cassandra, and Spring Data JPA."
    },
    {
      "id": "5uoky0",
      "speakers": ["ChiragNarang"],
      "talk": "A  Winning Multi-Cloud Data Strategy",
      "time": "12.30 - 1 pm",
      "start": "2021-01-20T12:30:00+05:30",
      "end": "2021-01-20T13:00:00+05:30",
      "description": "In this session, we will cover how to build a multi cloud data strategy with Yugabyte Platform. The session will cover these topics:<br /><ul><br /><li>What is multi-cloud?</li><br /><li>What are the benefits of adopting a multi-cloud strategy as it relates to data infrastructure?</li><br /><li>What challenges do database vendors need to overcome before claiming multi-cloud capabilities?</li><br /><li>How can adopting YugabyteDB enable your data infrastructure to support a multi-cloud strategy?</li><br /><li>Live demo of deploying a geo-distributed multi-cloud cluster with Yugabyte Platform</li></ul>"
    },
    {
      "id": "ydbl3r",
      "speakers": ["JohnForrest","TaylorMull"],
      "talk": "Day 2 Operations Best Practices",
      "time": "1 - 2 pm",
      "start": "2021-01-20T13:00:00+05:30",
      "end": "2021-01-20T14:00:00+05:30",
      "description": "In this session, John and Taylor from Yugabyte, walks through an overview of YugabyteDB's architecture and how to apply operational best practices to its administrations. Topics covered included:<br /><ul><br /><li>Self-service deployments</li><br /><li>Deployment topologies</li><br /><li>Automation</li><br /><li>Data recoverability</li><br /><li>Config management</li><br /><li>Monitoring & health checks</li><br /><li>Security integration</li><br /></ul>"
    },
    {
      "id": "vc24dm",
      "speakers": ["BhavinGandhi"],
      "talk": "Getting started with Yugabyte Kubernetes Operator",
      "time": "2 - 2.30 pm",
      "start": "2021-01-20T14:00:00+05:30",
      "end": "2021-01-20T14:30:00+05:30",
      "description": "The operator pattern has become one of the preferred ways to run applications on Kubernetes. Operators make it possible to do the desired state management of applications like databases. In this workshop, we will briefly discuss operators. And then we will show a series of demos about using the Yugabyte Operator on GKE, including provisioning a YugabyteDB cluster, scaling out, scaling back, and more."
    },
    {
      "id": "uf8d9d",
      "speakers": ["BreneshStanslasFlowerMary"],
      "talk": "Migrating from a Monolith to Microservices",
      "time": "2.30 - 3 pm",
      "start": "2021-01-20T14:30:00+05:30",
      "end": "2021-01-20T15:00:00+05:30",
      "description": "How a large intertwined Mainframe Monolith can be broken down into Microservices in a practical approach, using YugabyteDB as the distributed SQL database on the backend. The end-to-end approach covers Wipro’s proprietary \"moderniZ\" platform which addresses UI, Services and Data Transformation."
    }
  ],
  [    
    {
      "id": "djhitl",
      "speakers": ["GregHaskins"],
      "talk": "Architecting a Data Privacy Platform to Scale to Billions of Identities",
      "time": "10.30 - 11 am",
      "start": "2021-01-21T10:30:00+05:30",
      "end": "2021-01-21T11:00:00+05:30",
      "description": "We built the Manetu Consumer Privacy Management (CPM) platform to enable consumers to control their personal data and enterprises to comply with data privacy laws such as GDPR and CPRA. Architecting the system from the ground up for robust security and massive scale requires selecting the right mix of technologies to get the job done. In this talk, we show you how we built Manetu CPM using a microservices, CQRS architecture on Kubernetes backed by a distributed database, and the benefits this architecture provides."
    },
    {
      "id": "rgjt2s",
      "speakers": ["VirajParekh", "PeteDeJoy"],
      "talk": "Creating Standard Patterns to Load Data into Yugabyte with Apache Airflow",
      "time": "11 - 11.30 am",
      "start": "2021-01-21T11:00:00+05:30",
      "end": "2021-01-21T11:30:00+05:30",
      "description": "Apache Airflow is an open source workflow orchestrator that is used by data teams of all sizes. Given its flexible nature, Airflow is used to interact with everything from legacy on-prem systems to distributed, Kubernetes-native applications. As organizations undergo digital transformations, users responsible for data workloads are often tasked with coordinating these legacy and cloud native systems concurrently. The growing number and complexity of these workloads causes teams to require standardization layer around for maintainability, reusability, and extendability.<br /><br />This talk will showcase how data platform engineers can provide a standard template for users to perform business-specific actions with Apache Airflow to replicate Postgres data to a distributed Yugabyte instance. It will end with a brief overview of the Airflow Provider framework."
    },
    {
      "id": "p8mjfa",
      "speakers": ["DanZentgraf"],
      "talk": "Lessons DevOps Can Teach Us About Managing Internet-Scale Schemas",      
      "time": "11.30 am - 12 pm",
      "start": "2021-01-21T11:30:00+05:30",
      "end": "2021-01-21T12:00:00+05:30",
      "description": "Massively scalable 'NewSQL' database management systems have enabled teams to aggressively pursue their digital transformation initiatives at a time when employees, partners, and customers are more distributed than ever.<br /><br />However, the combined push for speedy digital transformations and the increased scale of the databases also increases the importance of well thought out, disciplined, automated schema management. The consequences of applying changes too slowly or, worse, breaking something at internet-scale are just too high.<br /><br />Fortunately, we can learn from lessons the DevOps movement have taught us. DevOps practitioners have been dealing with internet-scale applications for some time and we can apply what they've learned to the database to ultimately allow teams to operate safely at internet-scale while still meeting business expectations for internet speed when delivering new functionality.<br /><br />This session will discuss:<br /><ul><br /><li>The challenges of schema management in a distributed SQL database</li><br /><li>Balancing those challenges with delivery speed and safety</li><br /><li>Example workflows using Liquibase to perform schema updates on a distributed SQL database</li></ul>"
    },
    {
      "id": "s7zi2b",
      "speakers": ["LaurentGil"],
      "talk": "An Adventure in Multi-Cloud with Kubernetes and Distributed Data",
      "time": "12 - 12.30 pm",
      "start": "2021-01-21T12:00:00+05:30",
      "end": "2021-01-21T12:30:00+05:30",
      "description": "In this session, we will discuss the challenges, the traps, and everything you need to know to deploy a distributed Yugabyte database over multiple clouds using Kubernetes. We will also demonstrate in real time the advantages of multi cloud, such as performance, resiliency of the application to a cloud failure, cost optimization across clouds, and vertical and horizontal autoscaling using effective cost/performance compute resources.<br /><br />During the session, we will deploy a Yugabyte database within minutes on a cluster that spans AWS, Azure, and Google Cloud, with Highly Available and Fault Resilient setup."
    },
    {
      "id": "0wayh3",
      "speakers": ["CharlesPretzer"],
      "talk": "Linkerd/Buoyant - Coming Soon",
      "time": "12.30 - 1 pm",
      "start": "2021-01-21T12:30:00+05:30",
      "end": "2021-01-21T13:00:00+05:30"
    },
    {
      "id": "fuqmyr",
      "speakers": ["NikhilChandrappa"],
      "talk": "Scalable and Resilient GraphQL Subscriptions with Distributed SQL Databases",
      "time": "1 - 1.30 pm",
      "start": "2021-01-21T13:00:00+05:30",
      "end": "2021-01-21T13:30:00+05:30",
      "description": "GraphQL subscriptions are seeing broader adoption in building event-driven microservices. Popular GraphQL servers achieve subscriptions through live queries. Live queries are nothing but querying the backing database at a fixed time interval. Obviously, as the number of subscriptions increases, it increases the query load on the database. Any other DML operations on a database will strain the resources of the monolithic single-node database.<br /><br />In this talk, we will walk through steps for implementing resilient and scalable GraphQL subscriptions using Hasura Engine and YugabyteDB on Kubernetes. Components of the stack, including the database, can be linearly scaled independently of each other. In addition to linear scalability, GraphQL subscriptions will inherently become resilient against outages due to the fault tolerance and HA capabilities of distributed SQL databases."
    },
    {
      "id": "0d3qs3",
      "speakers": ["CetinYalcinGulec","ShivamArora","CemAladogan"],
      "talk": "Centralize Commercial Consent Database for 80M Citizens Across More Than 100K Companies",
      "time": "1.30 - 2 pm",
      "start": "2021-01-21T13:30:00+05:30",
      "end": "2021-01-21T14:00:00+05:30",
      "description": "It is important to provide speed, agility, consistency and redundancy while achieving scalability of a NoSQL database. There are challenges to store the data in high volume with high velocity and orchestrate separated data centers where STAs can query encrypted data less than 5 milliseconds. The system must replicate data in near real time between data centers that it is important to present the latest version of information to any requester. Using the distributed data management power of YugabyteDB, this talk will explain how distributed data can be served with Micro Services without compromising on performance or consistency"
    },
    {
      "id": "2o120c",
      "speakers": ["TobiasMeixner"],
      "talk": "A Migration Journey from Amazon DynamoDB to Yugabyte YSQL and Hasura",
      "time": "2 - 2.30 pm",
      "start": "2021-01-21T14:00:00+05:30",
      "end": "2021-01-21T14:30:00+05:30",
      "description": "Switching databases is painful, even more so going from NoSQL to SQL. This talk will give insights into BRIKL's migration path from Apollo Server and Amazon DynamoDB over to Hasura and Yugabyte YSQL, going from a growing monolith to a scalable service-oriented architecture."
    },
    {
      "id": "14mbp3",
      "speakers": ["NishantModak"],
      "talk": "Last9.io - Coming Soon",
      "time": "2.30 - 3 pm",
      "start": "2021-01-21T14:30:00+05:30",
      "end": "2021-01-21T15:00:00+05:30"
    }
  ],
  [
    {
      "id": "zdkqtc",
      "speakers": ["CorneliaDavis"],
      "talk": "Weaveworks - Coming Soon",
      "time": "10 - 10.30 am",
      "start": "2021-01-22T10:00:00+05:30",
      "end": "2021-01-22T10:30:00+05:30"
    },
    {
      "id": "6x6zbe",
      "speakers": ["PrasadBopardikar","MichaelJames"],
      "talk": "How to Easily Build, Deploy, and Manage Application and Distributed SQL Workloads Anywhere with Tanzu",
      "time": "10.30 - 11 am",
      "start": "2021-01-22T10:30:00+05:30",
      "end": "2021-01-22T11:00:00+05:30",
      "description": "We have learned the harsh reality that the consolidation of resources promised by the cloud has fragmented IT resources, complicated infrastructure management, exposed inconsistent and varied deployment mechanisms, and most importantly, made cost tracking more complicated than ever.<br /><br />Tanzu is a suite of products and services built on top of numerous CNCF OSS software packages and tools (Kubernetes, Buildpacks, and more) that seek to address these concerns by leveraging existing investments, whether hosted on-premises or public cloud, providing a portable and consistent management plane for operators and a common Kubernetes API control plane for developers.<br /><br />In this presentation we will demonstrate the ease with which to deploy workloads to a Tanzu Kubernetes Grid cluster while meeting the most rigorous demands of highly scalable, highly available distributed Yugabyte database workloads. Tanzu Build Service will be used to leverage Cloud Native buildpacks for generating OCI-compliant container images for our Spring application. Finally, the image will be stored and scanned for CVEs in Harbor Container Registry before being pushed to the target environment cluster."
    },
    {
      "id": "2i7n91",
      "speakers": ["RajibDeb","DhavalJagani"],
      "talk": "The Future of Databases",
      "time": "11 - 11.30 am",
      "start": "2021-01-22T11:00:00+05:30",
      "end": "2021-01-22T11:30:00+05:30",
      "description": "As organizations are rapidly moving their applications to the cloud, the need to scale the databases beyond zones, regions, and countries is also increasing. We have also seen the need to have data across cloud providers and data centers to be able to achieve a higher degree of resilience and availability. And all these needs should not sacrifice the transactional data consistency. In this talk, we will discuss how databases and supporting application architectures are evolving to meet the demands of distributed transactions."
    },
    {
      "id": "2nrj9y",
      "speakers": ["QinYu"],
      "talk": "How Xignite Delivers Real-Time Financial Data at Scale",
      "time": "11.30 am - 12 pm",
      "start": "2021-01-22T11:30:00+05:30",
      "end": "2021-01-22T12:00:00+05:30",
      "description": "Delivering real-time and reference market data at scale requires high scalability, high performance, and cost effectiveness. In this talk, Qin Yu, SVP of Engineering and Operations, will share Xignite’s cloud native database journey—from SQL Server on AWS with Amazon RDS to other database deployments to the current architecture powered by YugabyteDB. Along the way, Qin will share the strategy and key requirements behind the decisions to move a variety of enterprise workloads (time series and reference data, across lines of business) to distributed SQL."
    },
    {
      "id": "ct3gwj",
      "talk": "YugabyteDB Performance: History and Future",
      "speakers": ["CharlotteHamilton"],
      "time": "12 - 12.30 pm",
      "start": "2021-01-22T12:00:00+05:30",
      "end": "2021-01-22T12:30:00+05:30",
      "description": "From its inception YugabyteDB was designed with performance in mind. With greater rates of adoption and increased usage in the commercial world, the need for adaptation and improvement has remained a constant design driver with each new release. This talk covers the evolution of YugabyteDB’s performance design concepts, as well as the potential that lies ahead for even more Yugabyte performance."
    },
    {
      "id": "9c23yp",
      "speakers": ["AnjulSahu"],
      "talk": "Improving Security and Observability of YugabyteDB on Kubernetes",
      "time": "12.30 - 1 pm",
      "start": "2021-01-22T12:30:00+05:30",
      "end": "2021-01-22T13:00:00+05:30",
      "description": "This talk is an introduction to service mesh features in the context of YugabyteDB. In this talk, we will explore how the security and observability of the database and applications hosted on the Kubernetes platform can be improved without changing the code."
    },
    {
      "id": "pldncj",
      "speakers": ["ShraddhaAgrawal"],
      "talk": "Hasura Cloud + YugabyteDB: The Superpowers Developers Get with the Perfect Mix of GraphQL and Distributed SQL",
      "time": "1.30 - 2 pm",
      "start": "2021-01-22T13:30:00+05:30",
      "end": "2021-01-22T14:00:00+05:30",
      "description": "When it comes to building great products two things are essential from a developer stand point, the rate at which new product features are released and to reliably serve the application as it scales. But ensuring scalability while rapidly solving complex business problems simultaneously is hard.<br /><br />The answer lies in the architecture and the choice of components. For any given stack, there are three components, the API layer, database, and the business logic. The magic sauce, which we’ll explore in this talk, is how to combine these three components into an architecture that scales easily and at the same time boosts developer productivity.<br /><br />Once we have the architecture that helps us developers build quickly, we’ll discuss how the choice of GraphQL/Hasura (API) & Distributed SQL/Yugabyte (Database) & serverless functions (business logic) can solve the scalability problem out-of-the-box.<br /><br />By the end of this talk, I hope to show you how you can have your cake and eat it too, aka build stuff fast and have it scale out automatically without any dev effort."
    },
    {
      "id": "y3hijh",
      "speakers": ["PraveenKumarPurushothaman"],
      "talk": "Introducing YERN and YEAN: Developing Scalable React and Node.js Apps with Distributed SQL",
      "time": "2 - 2.30 pm",
      "start": "2021-01-22T14:00:00+05:30",
      "end": "2021-01-22T14:30:00+05:30",
      "description": "This talk is for developers interested in learning the fundamentals and best practices on how to develop React and Node.js apps on top of YugabyteDB. Topics covered include: the benefits of choosing YugabyteDB over MySQL or MongoDB, using CRA to build full stack React apps, connecting Express apps to YugabyteDB using the YSQL API, plus a walk through and demonstration of the sample applications we built during the talk."
    },
    {
      "id": "jdpi9f",
      "speakers": ["MichelleBrinich"],
      "talk": "Closing Keynote",
      "time": "2.30 - 3 pm",
      "start": "2021-01-22T14:30:00+05:30",
      "end": "2021-01-22T15:00:00+05:30",
      "description": "In this session, we’ll close out the Distributed SQL Summit Asia event with final remarks, including highlights from the week and more."
    }
  ]
]