[
        {
          "speakerPicture": "JamesWatters",
          "speakerName": "James Watters",
          "speakerId": "james-watters",
          "speakerDescription":"",
          "speakerPosition":"SVP Products",
          "speakerCompany":"Pivotal",
          "type":"talk",
          "talkTitle":"The Past, Present and Future of Enterprise IT in a Cloud-Native World",
          "featured": true,
          "sortOrder": 1,
          "timeSlot": 1,
          "twitter":"",
          "time":"9:00 - 9:30",
          "talkAbstract": "Today's modern enterprise applications and services are being designed from the ground up to support multi-cloud, hybrid and cloud-native environments. This is primarily being done to accelerate software delivery, ensure application portability and/or to satisfy security or compliance requirements. These cloud-native requirements are being similarly extended to the underlying database infrastructure that applications rely on. In this keynote, Jame Watters, SVP of Strategy at Pivotal, will walk us through the evolution, benefits and challenges that enterprise IT faces in transforming how it delivers applications, security, automation and data in a cloud-native first world."
        },
        {
          "speakerPicture": "TanmaiGopal",
          "speakerName": "Tanmai Gopal",
          "speakerId": "tanmai-gopal",
          "speakerDescription":"",
          "speakerPosition":"CEO/Co-Founder",
          "speakerCompany":"Hasura",
          "type":"talk",
          "talkTitle":"Building planet-scale cloud-native apps with GraphQL and distributed SQL",
          "featured": true,
          "sortOrder": 8,
          "timeSlot": 2,
          "talkAbstract":"Modern apps have users and data that are distributed all over the world. Cloud-native patterns allow developers to run their compute on infrastructure that is also spread globally. However, building these applications involves putting together a lot of different tools and patterns which makes it hard to move fast and slows down delivery. I will introduce GraphQL as a modern API layer that is helping developers accelerate product delivery and the patterns / challenges in making GraphQL work with distributed SQL. I’m going to discuss architectures, recipes and show you demos of a modern and seamless developer experience for application developers.",
          "twitter":"",
          "time":"9:30 - 10:00"
        },
        {
          "speakerPicture": "JeffRothschild",
          "speakerName": "Jeff Rothschild",
          "speakerId": "jeff-rothschild",
          "speakerDescription":"",
          "speakerPosition":"Entrepreneur & Engineer",
          "speakerCompany":"Ex-Facebook VP of Infrastructure",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur ",
          "featured": true,
          "sortOrder": 2,
          "timeSlot": 3,
          "mergeWith": "karthik-ranganathan",
          "panelist": true,
          "twitter":"",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "VictoriaDudin",
          "speakerName": "Victoria Dudin",
          "speakerId": "victoria-dudin",
          "speakerDescription":"",
          "speakerPosition":"Engineering Manager",
          "speakerCompany":"Facebook",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "featured": true,
          "sortOrder": 2.5,
          "timeSlot": 3,
          "mergeWith": "karthik-ranganathan",
          "panelist": true,
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur .",
          "twitter":"",
          "linkedin": "",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "VishalKathuria",
          "speakerName": "Vishal Kathuria",
          "speakerId": "vishal-kathuria",
          "speakerDescription":"",
          "speakerPosition":"Engineering Manager",
          "speakerCompany":"Facebook",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "featured": true,
          "sortOrder": 4,
          "timeSlot": 3,
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur ",
          "mergeWith": "karthik-ranganathan",
          "twitter":"",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "KadirOzdemir",
          "speakerName": "Kadir Ozdemir",
          "speakerId": "kadir-ozdemir",
          "speakerDescription":"Kadir Ozdemir is currently a big data storage architect at Salesforce. He has 18 years of data storage system development experience in delivering highly available distributed systems in roles including chief architect for large engineering teams at EMC and Symantec.  He has patents on various data storage and network systems and technologies, and published papers on data storage, formal protocol validation, neural networks, and expert systems. He holds a PhD in computer science from the University of Ottawa, Canada.",
          "speakerPosition":"Principal Architect",
          "speakerCompany":"Salesforce",
          "type":"talk",
          "talkTitle":"Strongly Consistent Global Indexes for Phoenix",
          "featured": true,
          "sortOrder": 4.5,
          "timeSlot": 6,
          "talkAbstract":"Without transactional tables, the global indexes can get easily out of sync with their data tables in Apache Phoenix. Transactional tables require a separate transaction manager, have some restrictions and performance penalties, are still in beta. This technical talk lays out a design to have strongly consistent global indexes without the need for an external transaction manager. In addition to having strongly consistent indexing, the proposed design aims to have minimal impact on read performance. In Phoenix, global indexing is implemented using a separate table for each secondary index of a table. Updating a table with one or more global index requires updating multiple table regions likely distributed over multiple region servers. Translating a single table update operation into a multi-table write operation poses consistency issues as Phoenix does not provide a reliable multi-table update capability without using transactional tables. Although updating multiple tables (in our case, a data table and its indexes) atomically requires implementing a form of two-phase commit protocol, we have observed that achieving strongly consistent global indexing does not require implementing a general-purpose transaction capability. Another important observation is that HBase is a log-structured data store, that is, updates are never done in place. In these systems, writes are much faster when compared to in-place update systems because random writes are handled as fast as sequential writes. This allows us to add an extra write phase during updates without severely impacting the write performance, which simplifies the overall design. In this talk, we will present the details of the proposed design, the proof of its correctness, and our performance analysis and test results.",
          "twitter":"",
          "time":"11:30 - 12:00"
        },
        {
          "speakerPicture": "KamalGupta",
          "speakerName": "Kamal Gupta",
          "speakerId": "kamal-gupta",
          "speakerDescription":"",
          "speakerPosition":"Head of Engineering, Aurora",
          "speakerCompany":"Amazon",
          "type":"talk",
          "talkTitle":"An Introduction to Amazon Aurora",
          "featured": true,
          "sortOrder": 6,
          "timeSlot": 13,
          "talkAbstract":"Amazon Aurora is a relational database service for OLTP workloads offered as part of Amazon Web Services (AWS). In this talk, we describe how Aurora brings a novel architecture to the relational database by pushing redo processing to a multi-tenant scale-out storage service, purpose-built for Aurora. We describe how doing so not only reduces network traffic, but also allows for fast crash recovery, failovers to replicas without loss of data, and fault-tolerant, self-healing storage.",
          "twitter":"",
          "linkedin": "",
          "time":"15:30 - 16:00"
        },
        {
          "speakerPicture": "HarrisonFisk",
          "speakerName": "Harrison Fisk",
          "speakerId": "harrison-fisk",
          "speakerDescription":"",
          "speakerPosition":"Director Production Engineering",
          "speakerCompany":"Facebook",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "featured": true,
          "sortOrder": 7.5,
          "timeSlot": 3,
          "mergeWith": "karthik-ranganathan",
          "panelist": true,
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur .",
          "twitter":"",
          "linkedin": "",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "CampbellFraser",
          "speakerName": "Campbell Fraser",
          "speakerId": "campbell-fraser",
          "speakerDescription":"",
          "speakerPosition":"Software Development Lead",
          "speakerCompany":"Google",
          "type":"talk",
          "talkTitle":"Google Spanner's SQL Evolution",
          "featured": true,
          "sortOrder": 7,
          "timeSlot": 5,
          "talkAbstract":"Spanner is a globally-distributed data management system that backs hundreds of mission-critical services at Google. Spanner is built on ideas from both the systems and database communities. The first Spanner paper published at OSDI 2012 focused on the systems aspects such as scalability, automatic sharding, fault tolerance, consistent replication, external consistency, and wide-area distribution. A subsequent paper in SIGMOD 2017 highlighted the database DNA of Spanner. This presentation builds on that second paper; we describe distributed SQL query execution in the presence of resharding, query restarts upon transient failures, range extraction that drives query routing and index seeks, and the improved blockwise columnar storage format. We touch upon the common SQL dialect shared with other systems at Google.",
          "twitter":"",
          "linkedin": "campbell-fraser-466ba01",
          "time":"11:00 - 11:30"
        },
        {
          "speakerPicture": "RyanScheidter",
          "speakerName": "Ryan Scheidter",
          "speakerId": "ryan-scheidter",
          "speakerDescription":"Ryan is a full-stack developer and architect who has been building and maintaining distributed systems at Cerner for 11 years.",
          "speakerPosition":"Lead Software Engineer",
          "speakerCompany":"Cerner",
          "type":"talk",
          "talkTitle":"Building Microservices in a Cloud-Native World with Distributed SQL",
          "featured": true,
          "sortOrder": 8.5,
          "timeSlot": 10,
          "talkAbstract":"Microservices and cloud-native deployments have ushered in an era of unparalleled developer agility. The portability offered by technologies such as Kubernetes and Cloud Foundry ensures that applications can be run anywhere and everywhere. But what about the data? In this talk we'll examine where a distributed SQL database fits into a modern hybrid/multi-cloud architecture, as well as possibilities/implications for the applications themselves.",
          "twitter":"",
          "linkedin": "",
          "time":"14:00 - 14:30"
        },
        {
          "speakerPicture": "PeterZaitsev",
          "speakerName": "Peter Zaitsev",
          "speakerId": "peter-zaitsev",
          "speakerDescription":"",
          "speakerPosition":"Founder & CEO",
          "speakerCompany":"Percona",
          "type":"talk",
          "talkTitle":"Distributed MySQL Architectures, Past, Present and Future",
          "featured": true,
          "sortOrder": 9,
          "timeSlot": 8,
          "talkAbstract":"Although MySQL is now more than two decades old, it continues to power some of the world's largest internet applications. In this presentation we'll look at the history and evolution of distributed MySQL deployments. We'll explore the original designs and the common architecture patterns still in use today. Finally, we'll predict what the future has in store for us with the advent of the cloud and containers as the new operating environments for databases.",
          "twitter":"",
          "linkedin": "",
          "time":"12:30 - 13:00"
        },
        {
          "speakerPicture": "DhrubaBorthakur",
          "speakerName": "Dhruba Borthakur",
          "speakerId": "dhruba-borthakur",
          "speakerDescription":"",
          "speakerPosition":"Co-Founder & CTO",
          "speakerCompany":"Rockset",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "featured": true,
          "sortOrder": 10,
          "timeSlot": 3,
          "mergeWith": "karthik-ranganathan",
          "panelist": true,
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur ",
          "twitter":"",
          "linkedin": "",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "RobertWinslow",
          "speakerName": "Robert Winslow",
          "speakerId": "robert-winslow",
          "speakerDescription":"",
          "speakerPosition":"Performance Engineer &",
          "speakerCompany":"Data Scientist",
          "type":"talk",
          "talkTitle":"Benchmarking Distributed SQL Databases",
          "featured": true,
          "sortOrder": 12,
          "timeSlot": 7,
          "talkAbstract":"Traditional RDBMS databases run on a single node, and therefore the benchmarks designed for these systems make that implicit assumption. Distributed SQL databases are a new breed that operate on a cluster of nodes. These databases have fundamentally different architectures, requiring a different benchmarking methodology. For example, the network latency between the nodes begins to dominate the write latency since data is replicated synchronously. Understanding the impact of network latency is critical to getting optimal performance. In this talk, we will look at the transactional cloud serving benchmark or TCSB framework built to benchmark distributed, transactional databases, and the results of benchmarking a few such DBs.",
          "twitter":"",
          "time":"12:00 - 12:30"
        },
        {
          "speakerPicture": "Lunch",
          "speakerName": "Lunch",
          "speakerId": "lunch",
          "time":"13:00 - 14:00",
          "timeSlot": 9
        },
        {
          "speakerPicture": "GuillermoTantachuco",
          "speakerName": "Guillermo Tantachuco",
          "speakerId": "guillermo-tantachuco",
          "speakerDescription":"",
          "speakerPosition":"Principal Platform Architect",
          "speakerCompany":"Pivotal",
          "type":"talk",
          "talkTitle":"Spring Forward to a Cloud-Native PostgreSQL",
          "featured": true,
          "sortOrder": 13,
          "timeSlot": 12,
          "coPresenting": true,
          "talkAbstract":"Business critical applications of the past are monolithic in design and run on proprietary databases like Oracle. These are being transformed into microservice-based cloud-native applications using popular frameworks like Spring - while the database itself is moving to cloud-native PostgreSQL deployments and distributed SQL databases. This talk will cover how Spring is evolving to enable building microservices on distributed SQL databases using a real world example. We will look at cloud-native aspects such as how to eliminate the load balancer by using cluster-aware SQL drivers, making discovery of the underlying database topology possible in applications and using reactive programming against SQL using R2DBC in the context of the application. Finally, we will conclude with a summary of the work actively happening in this area and what the future holds.",
          "twitter":"",
          "time":"15:00 - 15:30"
        },
        {
          "speakerPicture": "NikhilChandrappa",
          "speakerName": "Nikhil Chandrappa",
          "speakerId": "nikhil-chandrappa",
          "speakerDescription":"",
          "speakerPosition":"Senior Platform Architect",
          "speakerCompany":"Pivotal",
          "type":"talk",
          "talkTitle":"Spring Forward to a Cloud-Native PostgreSQL",
          "featured": true,
          "sortOrder": 14,
          "timeSlot": 12,
          "mergeWith": "guillermo-tantachuco",
          "talkAbstract":"Business critical applications of the past are monolithic in design and run on proprietary databases like Oracle. These are being transformed into microservice-based cloud-native applications using popular frameworks like Spring - while the database itself is moving to cloud-native PostgreSQL deployments and distributed SQL databases. This talk will cover how Spring is evolving to enable building microservices on distributed SQL databases using a real world example. We will look at cloud-native aspects such as how to eliminate the load balancer by using cluster-aware SQL drivers, making discovery of the underlying database topology possible in applications and using reactive programming against SQL using R2DBC in the context of the application. Finally, we will conclude with a summary of the work actively happening in this area and what the future holds.",
          "twitter":"",
          "time":"15:00 - 15:30"
        },
        {
          "speakerPicture": "RajkumarSen",
          "speakerName": "Rajkumar Sen",
          "speakerId": "rajkumar-sen",
          "speakerDescription":"",
          "speakerPosition":"Chief Technical Architect, Founder",
          "speakerCompany":"BlitzzIO",
          "type":"talk",
          "talkTitle":"How-To: Zero Downtime Migrations from Oracle to a Cloud-Native PostgreSQL",
          "featured": true,
          "sortOrder": 15,
          "timeSlot": 11,
          "talkAbstract":"Legacy applications are transforming rapidly. They are being broken down into cloud-native microservices. This phase is followed by a database transformation phase, where the database tier comprising legacy is modernized. Distributed SQL databases being cloud-native and feature-rich are a great migration choice. In this talk, we will look at what database features are required to replace legacy databases like Oracle in the cloud, along with various do’s and don’ts. We will also look at a live demo of migrating an Oracle database to a distributed SQL database.",
          "twitter":"",
          "time":"14:30 - 15:00"
        },
        {
          "speakerPicture": "KarthikRanganathan",
          "speakerName": "Karthik Ranganathan",
          "speakerId": "karthik-ranganathan",
          "speakerDescription":"",
          "speakerPosition":"Co-Founder & CTO",
          "speakerCompany":"YugaByte",
          "type":"panel",
          "talkTitle":"Panel: Facebook's Distributed Database Evolution",
          "featured": true,
          "sortOrder": 16,
          "timeSlot": 3,
          "isModerator": true,
          "talkAbstract":"Building cloud-native applications that are high performance, fault tolerant and scalable is a core competency at Facebook. As more traditional enterprises begin to move their data tier to the cloud and containerized environments, they are encountering many of the challenges that Facebook has already solved. In this panel discussion we dive into Facebook's distributed database journey covering technologies like MySQL UDB, RocksDB and ZippyDB. Panelists include Jeff Rothschild, Victoria Dudin, Vishal Kathuria, Harrison Fisk and Dhruba Borthakur ",
          "twitter":"",
          "time":"10:00 - 11:00"
        },
        {
          "speakerPicture": "RamRavichandran",
          "speakerName": "Ram Ravichandran",
          "speakerId": "ram-ravichandran",
          "speakerDescription":"",
          "speakerPosition":"CTO",
          "speakerCompany":"Narvar",
          "type":"talk",
          "talkTitle":"Scaling Microservices and Distributed Databases in a Multi-Cloud World",
          "featured": true,
          "sortOrder": 5,
          "timeSlot": 14,
          "talkAbstract":"70% of U.S. adults have experienced better retail through Narvar's customer engagement platform. In this talk, Ram Ravichandran - CTO, walks us through some of the highlights on how Narvar scaled their microservices architecture and data-tier onto multiple clouds. He'll also discuss how they simplified their operations and maintained GDPR compliance through the entire process.",
          "twitter":"",
          "time":"16:00 - 16:30"
        },
        {
          "speakerPicture": "MuruGuruswamy",
          "speakerName": "Muru Guruswamy",
          "speakerId": "muru-guruswamy",
          "speakerDescription":"",
          "speakerPosition":"Principal Data Architect",
          "speakerCompany":"Plume Designs Inc",
          "featured": true,
          "type":"talk",
          "talkTitle":"Powering millions of smart homes with near real-time cloud-agnostic, distributed SQL",
          "sortOrder": 11,
          "timeSlot": 15,
          "talkAbstract":"Plume Design, an Intelligent Wi-Fi services delivery platform for the smart home, provides millions of smart homes with cloud-native distributed SQL in the cloud. Muru Guruswamy, Data Architect talks about the journey of how Plume Design chose distributed SQL to handle massive data in the cloud in a very secure way. In this presentation, we will talk about some of the data volumes handled by Plume Design. Finally, we will conclude with what the future holds for Wi-Fi enabled smart homes.",
          "twitter":"",
          "time":"16:30 - 17:00"
        }
]
